app/Controllers/Praktikum.php

    public function profil(): string
    {
        $model = new MahasiswaModel();

        if (!$model->find('32602300061')) {
    // Coba masukkan data
    if (!$model->insert([
        'nim' => '32602300061',
        'nama' => 'Naufal Labiib Quthb Himawan',
        'prodi' => 'Teknik Informatika'
    ])) {
        dd($model->errors()); // tampilkan jika gagal
    } else {
        echo "Data berhasil ditambahkan!<br>";
    }
}

        // Ambil semua data dari tabel
        $data['mahasiswa'] = $model->findAll();
---
SELECT *
FROM `tb_mahasiswa`